In [1]:
# Load the required libraries
import os

import matplotlib.pyplot as plt
import pandas as pd

# Loading different datasets

In [2]:
path = '../data/'

files = os.listdir(path)

print('All files:')
for f in files:
	print(f,end='\t')
    
print('csv files')
for f in files:
    if '.csv' in f:
        print(f,end='\t')

All files:
timesData.csv	cwurData.csv	archive.zip	shanghaiData.csv	school_and_country_table.csv	education_expenditure_supplementary_data.csv	educational_attainment_supplementary_data.csv	csv files
timesData.csv	cwurData.csv	shanghaiData.csv	school_and_country_table.csv	education_expenditure_supplementary_data.csv	educational_attainment_supplementary_data.csv

## EDA: timesData.csv

In [3]:
timesData = pd.read_csv('../data/timesData.csv')
timesData.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
0,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,"20,152",8.9,25%,NaN,2011
1,2,California Institute of Technology,United States of America,97.7,54.6,98.0,99.9,83.7,96.0,"2,243",6.9,27%,33 : 67,2011
2,3,Massachusetts Institute of Technology,United States of America,97.8,82.3,91.4,99.9,87.5,95.6,"11,074",9.0,33%,37 : 63,2011
3,4,Stanford University,United States of America,98.3,29.5,98.1,99.2,64.3,94.3,"15,596",7.8,22%,42 : 58,2011
4,5,Princeton University,United States of America,90.9,70.3,95.4,99.9,-,94.2,"7,929",8.4,27%,45 : 55,2011

In [4]:
# Number of rows and columns in dataframe
print('#rows: ',timesData.shape[0],' #columns:', timesData.shape[1])

#rows:  2603  #columns: 14

In [5]:
timesData.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2603 entries, 0 to 2602
Data columns (total 14 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   world_rank              2603 non-null   object
 1   university_name         2603 non-null   object
 2   country                 2603 non-null   object
 3   teaching                2603 non-null   float64
 4   international           2603 non-null   object
 5   research                2603 non-null   float64
 6   citations               2603 non-null   float64
 7   income                  2603 non-null   object
 8   total_score             2603 non-null   object
 9   num_students            2544 non-null   object
 10  student_staff_ratio     2544 non-null   float64
 11  international_students  2536 non-null   object
 12  female_male_ratio       2370 non-null   object
 13  year                    2603 non-null   int64
dtypes: float64(4), int64(1), object(9)
memory usage: 284.8+ KB

In [6]:
# Columns in data
print('columns',timesData.columns)

columns Index(['world_rank', 'university_name', 'country', 'teaching', 'international',
       'research', 'citations', 'income', 'total_score', 'num_students',
       'student_staff_ratio', 'international_students', 'female_male_ratio',
       'year'],
      dtype='object')

In [7]:
timesData.dtypes

world_rank                 object
university_name            object
country                    object
teaching                  float64
international              object
research                  float64
citations                 float64
income                     object
total_score                object
num_students               object
student_staff_ratio       float64
international_students     object
female_male_ratio          object
year                        int64
dtype: object

### Data cleanup
1. international_students: remove %
2. female-male ratio: split column

In [8]:
timesData['international'] = pd.to_numeric(timesData['international'], errors='coerce')
timesData['income'] = pd.to_numeric(timesData['income'], errors='coerce')
timesData['total_score'] = pd.to_numeric(timesData['total_score'], errors='coerce')

In [9]:
def convertcomma(x):
    if isinstance(x, str):
        x = x.replace(',','')
    return x
timesData['num_students']= timesData['num_students'].apply(lambda x: convertcomma(x))
timesData['num_students'] = pd.to_numeric(timesData['num_students'], errors='coerce')

In [10]:
def convertpercentage(x):
    if isinstance(x, str):
        x = x.replace('%','')
    return x
timesData['international_students'] = timesData['international_students'].apply(lambda x: convertpercentage(x))
timesData['international_students'] = pd.to_numeric(timesData['international_students'], errors='coerce')

In [11]:
timesData[['female','male']] = timesData['female_male_ratio'].str.split(':',expand=True) 
timesData['female'] = pd.to_numeric(timesData['female'], errors='coerce')
timesData['male'] = pd.to_numeric(timesData['male'], errors='coerce')

In [12]:
timesData.dtypes

world_rank                 object
university_name            object
country                    object
teaching                  float64
international             float64
research                  float64
citations                 float64
income                    float64
total_score               float64
num_students              float64
student_staff_ratio       float64
international_students    float64
female_male_ratio          object
year                        int64
female                    float64
male                      float64
dtype: object

In [13]:
timesData['num_students']

0       20152.0
1        2243.0
2       11074.0
3       15596.0
4        7929.0
         ...
2598    21958.0
2599    31268.0
2600     4122.0
2601    10117.0
2602     8663.0
Name: num_students, Length: 2603, dtype: float64

## EDA: cwurData

In [16]:
cwurData = pd.read_csv('../data/cwurData.csv')
cwurData.head()

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.00,2012
1,2,Massachusetts Institute of Technology,USA,2,9,17,3,12,4,4,NaN,1,91.67,2012
2,3,Stanford University,USA,3,17,11,5,4,2,2,NaN,15,89.50,2012
3,4,University of Cambridge,United Kingdom,1,10,24,4,16,16,11,NaN,50,86.17,2012
4,5,California Institute of Technology,USA,4,2,29,7,37,22,22,NaN,18,85.21,2012

In [17]:
# Types in the dataframe
cwurData.dtypes

world_rank                int64
institution              object
country                  object
national_rank             int64
quality_of_education      int64
alumni_employment         int64
quality_of_faculty        int64
publications              int64
influence                 int64
citations                 int64
broad_impact            float64
patents                   int64
score                   float64
year                      int64
dtype: object

## shanghaiData

In [18]:
shanghaiData = pd.read_csv('../data/shanghaiData.csv')
shanghaiData.head()

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year
0,1,Harvard University,1,100.0,100.0,100.0,100.0,100.0,100.0,72.4,2005
1,2,University of Cambridge,1,73.6,99.8,93.4,53.3,56.6,70.9,66.9,2005
2,3,Stanford University,2,73.4,41.1,72.2,88.5,70.9,72.3,65.0,2005
3,4,"University of California, Berkeley",3,72.8,71.8,76.0,69.4,73.9,72.2,52.7,2005
4,5,Massachusetts Institute of Technology (MIT),4,70.1,74.0,80.6,66.7,65.8,64.3,53.0,2005

In [19]:
shanghaiData.dtypes

world_rank          object
university_name     object
national_rank       object
total_score        float64
alumni             float64
award              float64
hici               float64
ns                 float64
pub                float64
pcp                float64
year                 int64
dtype: object

## school_and_country_table.csv

In [20]:
school_country = pd.read_csv('../data/school_and_country_table.csv')
school_country.head()

                             school_name                   country
0                     Harvard University  United States of America
1     California Institute of Technology  United States of America
2  Massachusetts Institute of Technology  United States of America
3                    Stanford University  United States of America
4                   Princeton University  United States of America

In [21]:
school_country.dtypes

school_name    object
country        object
dtype: object

In [25]:
school_country['school_name'].value_counts()

University of Iowa                           1
Indian Institute of Technology Kanpur        1
University of Valencia                       1
Otto von Guericke University of Magdeburg    1
Montpellier University                       1
                                            ..
Feng Chia University                         1
Aristotle University of Thessaloniki         1
University of Alaska Fairbanks               1
University of the Andes, Colombia            1
Zhejiang University                          1
Name: school_name, Length: 818, dtype: int64

## Supplimentary data: education_expenditure_supplementary_data.csv

In [35]:
edu_expend = pd.read_csv('../data/education_expenditure_supplementary_data.csv',sep=',')
edu_expend.head()

,country,institute_type,direct_expenditure_type,1995,2000,2005,2009,2010,2011
0,OECD Average,All Institutions,Public,4.9,4.9,5.0,5.4,5.4,5.3
1,Australia,All Institutions,Public,4.5,4.6,4.3,4.5,4.6,4.3
2,Austria,All Institutions,Public,5.3,5.4,5.2,5.7,5.6,5.5
3,Belgium,All Institutions,Public,5.0,5.1,5.8,6.4,6.4,6.4
4,Canada,All Institutions,Public,5.8,5.2,4.8,5.0,5.2,NaN

In [36]:
edu_expend.columns

Index(['country', 'institute_type', 'direct_expenditure_type', '1995', '2000',
       '2005', '2009', '2010', '2011'],
      dtype='object')

## Supplimentary data: educational_attainment_supplementary_data.csv

In [37]:
edu_attain = pd.read_csv('../data/educational_attainment_supplementary_data.csv',sep=',')
edu_attain.head()

,country_name,series_name,1985,1986,1987,1990,1991,1992,1993,1995,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,2015
0,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.33,NaN,NaN,0.44,NaN,NaN,NaN,0.57,...,0.86,NaN,NaN,NaN,NaN,1.27,NaN,NaN,NaN,NaN
1,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1.03,NaN,NaN,1.26,NaN,NaN,NaN,1.54,...,2.18,NaN,NaN,NaN,NaN,2.64,NaN,NaN,NaN,NaN
2,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.83,NaN,NaN,0.95,NaN,NaN,NaN,1.26,...,1.01,NaN,NaN,NaN,NaN,2.45,NaN,NaN,NaN,NaN
3,Afghanistan,"Barro-Lee: Average years of primary schooling,...",2.34,NaN,NaN,2.22,NaN,NaN,NaN,2.37,...,2.26,NaN,NaN,NaN,NaN,3.55,NaN,NaN,NaN,NaN
4,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.54,NaN,NaN,0.92,NaN,NaN,NaN,0.94,...,2.00,NaN,NaN,NaN,NaN,1.29,NaN,NaN,NaN,NaN

In [39]:
edu_attain['series_name'].value_counts()

Barro-Lee: Average years of secondary schooling, age 35-39, total                                                          186
Barro-Lee: Percentage of female population age 45-49 with tertiary schooling. Total (Incomplete and Completed Tertiary)    186
Barro-Lee: Average years of tertiary schooling, age 20-24, female                                                          186
UIS: Percentage of population age 25+ with a completed bachelor's or equivalent degree (ISCED 6). Male                     186
Barro-Lee: Percentage of population age 55-59 with secondary schooling. Total (Incomplete and Completed Secondary)         186
                                                                                                                          ...
Barro-Lee: Percentage of population age 75+ with secondary schooling. Completed Secondary                                  186
Barro-Lee: Percentage of population age 40-44 with tertiary schooling. Completed Tertiary                                  186
Barro-Lee: Percentage of population age 40-44 with tertiary schooling. Total (Incomplete and Completed Tertiary)           186
Barro-Lee: Percentage of population age 50-54 with primary schooling. Completed Primary                                    186
Barro-Lee: Average years of tertiary schooling, age 25-29, total                                                           186
Name: series_name, Length: 425, dtype: int64